@ismail-shahzad I think this is in good shape, below is the output of `terraform apply`.  I believe most of the changes are either explicitly intended, or a consequence of updating the EKS module version.  It does look like this will trigger a recreate of the Managed Node Group.  I believe that this will result in a new node group (and nodes) being created, then the pods will be migrated over, then the old one will be destroyed.  Ideally this will not cause down time of the Data Explorer, but it might.  Please take a look and let me know if you have any concerns:
```
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply" which may have affected this plan:

  # module.infrastructure.module.ckan_eks.module.eks.aws_eks_cluster.this[0] has changed
  ~ resource "aws_eks_cluster" "this" {
        id                            = "ckan-dev"
        name                          = "ckan-dev"
      ~ platform_version              = "eks.23" -> "eks.28"
        tags                          = {
            "Environment" = "dev"
        }
        # (11 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.infrastructure.module.ckan_eks.module.eks.module.kms.aws_kms_key.this[0] has changed
  ~ resource "aws_kms_key" "this" {
        id                                 = "f64fc288-019a-4f16-b35d-23b27000ae97"
      + region                             = "us-east-1"
        tags                               = {
            "Environment" = "dev"
        }
        # (12 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or
respond to these changes.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.infrastructure.module.ckan_eks.aws_eks_access_entry.admin_role["arn:aws:iam::245948672511:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_AWSAdministratorAccess_69d61212ea5659d4"] will be created
  + resource "aws_eks_access_entry" "admin_role" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "ckan-dev"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::245948672511:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_AWSAdministratorAccess_69d61212ea5659d4"
      + region            = "us-east-1"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.infrastructure.module.ckan_eks.aws_eks_access_entry.admins will be created
  + resource "aws_eks_access_entry" "admins" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "ckan-dev"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "system:masters",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::245948672511:role/eks-admin"
      + region            = "us-east-1"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = "eks-admin"
    }

  # module.infrastructure.module.ckan_eks.helm_release.ngnix_ingress will be updated in-place
  ~ resource "helm_release" "ngnix_ingress" {
        id                         = "nginx-ingress-production"
        name                       = "nginx-ingress-production"
        # (28 unchanged attributes hidden)
    }

  # module.infrastructure.module.ckan_eks.helm_release.sealed_secrets will be updated in-place
  ~ resource "helm_release" "sealed_secrets" {
      ~ id                         = "sealed-secrets-controller" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "0.23.1" -> (known after apply)
          ~ chart          = "sealed-secrets" -> (known after apply)
          ~ first_deployed = 1694124598 -> (known after apply)
          ~ last_deployed  = 1760111936 -> (known after apply)
          ~ name           = "sealed-secrets-controller" -> (known after apply)
          ~ namespace      = "default" -> (known after apply)
          ~ notes          = <<-EOT
                ** Please be patient while the chart is being deployed **
                
                Watch the SealedSecret controller status using the command:
                
                    kubectl get deploy -w --namespace default -l app.kubernetes.io/name=sealed-secrets,app.kubernetes.io/instance=sealed-secrets-controller
                
                Once the controller is up and ready, you should be able to create sealed secrets.
                
                1. Install the client-side tool (kubeseal) as explained in the docs below:
                
                    https://github.com/bitnami-labs/sealed-secrets#installation-from-source
                
                2. Create a sealed secret file running the command below:
                
                    kubectl create secret generic secret-name --dry-run=client --from-literal=foo=bar -o yaml | \
                    kubeseal \
                      --controller-name=sealed-secrets-controller \
                      --controller-namespace=default \
                      --format yaml > mysealedsecret.yaml
                
                The file mysealedsecret.yaml is a commitable file.
                
                If you would rather not need access to the cluster to generate the sealed secret you can run:
                
                    kubeseal \
                      --controller-name=sealed-secrets-controller \
                      --controller-namespace=default \
                      --format yaml > mysealedsecret.yaml
                
                to retrieve the public cert used for encryption and store it locally. You can then run 'kubeseal --cert mycert.pem' instead to use the local cert e.g.
                
                    kubectl create secret generic secret-name --dry-run=client --from-literal=foo=bar -o yaml | \
                    kubeseal \
                      --controller-name=sealed-secrets-controller \
                      --controller-namespace=default \
                      --format yaml --cert mycert.pem > mysealedsecret.yaml
                
                3. Apply the sealed secret:
                
                    kubectl create -f mysealedsecret.yaml
                
                Running 'kubectl get secret secret-name -o yaml' will show the decrypted secret that was generated from the sealed secret.
                
                Both the SealedSecret and generated Secret must have the same name and namespace.
            EOT -> (known after apply)
          ~ revision       = 8 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "1.5.2" -> (known after apply)
        } -> (known after apply)
        name                       = "sealed-secrets-controller"
      - postrender                 = {
          - args        = [] -> null
          - binary_path = "" -> null
        } -> null
      - set                        = [] -> null
      - set_list                   = [] -> null
      - set_sensitive              = [] -> null
      - set_wo_revision            = 1 -> null
      ~ status                     = "failed" -> "deployed"
        # (25 unchanged attributes hidden)
    }

  # module.infrastructure.module.ckan_eks.kubectl_manifest.cluster_role will be updated in-place
  ~ resource "kubectl_manifest" "cluster_role" {
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterroles/cluster-autoscaler"
        name                    = "cluster-autoscaler"
        # (15 unchanged attributes hidden)
    }

  # module.infrastructure.module.ckan_eks.kubectl_manifest.cluster_role_binding will be updated in-place
  ~ resource "kubectl_manifest" "cluster_role_binding" {
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cluster-autoscaler"
        name                    = "cluster-autoscaler"
        # (15 unchanged attributes hidden)
    }

  # module.infrastructure.module.ckan_eks.kubectl_manifest.deployment will be updated in-place
  ~ resource "kubectl_manifest" "deployment" {
        id                      = "/apis/apps/v1/namespaces/kube-system/deployments/cluster-autoscaler"
        name                    = "cluster-autoscaler"
        # (16 unchanged attributes hidden)
    }

  # module.infrastructure.module.ckan_eks.kubectl_manifest.role will be updated in-place
  ~ resource "kubectl_manifest" "role" {
        id                      = "/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/roles/cluster-autoscaler"
        name                    = "cluster-autoscaler"
        # (16 unchanged attributes hidden)
    }

  # module.infrastructure.module.ckan_eks.kubectl_manifest.role_binding will be updated in-place
  ~ resource "kubectl_manifest" "role_binding" {
        id                      = "/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/rolebindings/cluster-autoscaler"
        name                    = "cluster-autoscaler"
        # (16 unchanged attributes hidden)
    }

  # module.infrastructure.module.ckan_eks.kubectl_manifest.service_account will be updated in-place
  ~ resource "kubectl_manifest" "service_account" {
        id                      = "/api/v1/namespaces/kube-system/serviceaccounts/cluster-autoscaler"
        name                    = "cluster-autoscaler"
        # (16 unchanged attributes hidden)
    }

  # module.infrastructure.module.ckan_eks.module.cert_manager.helm_release.cert_manager will be updated in-place
  ~ resource "helm_release" "cert_manager" {
        id                         = "cert-manager"
        name                       = "cert-manager"
        # (28 unchanged attributes hidden)
    }

  # module.infrastructure.module.ckan_eks.module.cert_manager.kubectl_manifest.cluster_issuer[0] will be updated in-place
  ~ resource "kubectl_manifest" "cluster_issuer" {
        id                      = "/apis/cert-manager.io/v1/clusterissuers/cert-manager"
        name                    = "cert-manager"
        # (15 unchanged attributes hidden)
    }

  # module.infrastructure.module.ckan_eks.module.eks.data.tls_certificate.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.us-east-1.amazonaws.com/id/CC8A3A317728888AD3793D51F6434E7F"
    }

  # module.infrastructure.module.ckan_eks.module.eks.aws_eks_cluster.this[0] will be updated in-place
  ~ resource "aws_eks_cluster" "this" {
        id                            = "ckan-dev"
        name                          = "ckan-dev"
      ~ tags                          = {
            "Environment"           = "dev"
          + "terraform-aws-modules" = "eks"
        }
      ~ tags_all                      = {
          + "terraform-aws-modules" = "eks"
            # (1 unchanged element hidden)
        }
        # (13 unchanged attributes hidden)

      ~ access_config {
          ~ authentication_mode                         = "CONFIG_MAP" -> "API_AND_CONFIG_MAP"
            # (1 unchanged attribute hidden)
        }

      - timeouts {}

        # (5 unchanged blocks hidden)
    }

  # module.infrastructure.module.ckan_eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "oidc_provider" {
        id              = "arn:aws:iam::245948672511:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/CC8A3A317728888AD3793D51F6434E7F"
        tags            = {
            "Environment" = "dev"
            "Name"        = "ckan-dev-eks-irsa"
        }
      ~ thumbprint_list = [
          - "06b25927c42a721631c1efd9431e648fa62e1e39",
          - "2ad974a775f73cbdbbd8f5ac3a49255fa8fb1f8c",
          - "d7d10ac1fd7e87f1a3787a9a8be9b0f8538ec059",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.infrastructure.module.ckan_eks.module.eks.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = "sts:AssumeRole" -> [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "ckan-dev-cluster-20230907213954714200000001"
        name                  = "ckan-dev-cluster-20230907213954714200000001"
        tags                  = {
            "Environment" = "dev"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.infrastructure.module.ckan_eks.module.eks.aws_iam_role_policy_attachment.additional["eks_vpccontroller"] will be created
  + resource "aws_iam_role_policy_attachment" "additional" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "ckan-dev-cluster-20230907213954714200000001"
    }

  # module.infrastructure.module.ckan_eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] will be destroyed
  # (because key ["AmazonEKSVPCResourceController"] is not in for_each map)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "ckan-dev-cluster-20230907213954714200000001-20230907213956659200000002" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController" -> null
      - role       = "ckan-dev-cluster-20230907213954714200000001" -> null
    }

  # module.infrastructure.module.ckan_eks.module.eks.aws_security_group_rule.node["ingress_cluster_10251_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 10251/tcp webhook"
      + from_port                = 10251
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-east-1"
      + security_group_id        = "sg-08b35749ab415ceae"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-04710ea1bfaf06067"
      + to_port                  = 10251
      + type                     = "ingress"
    }

  # module.infrastructure.module.ckan_eks.module.eks.kubernetes_config_map_v1_data.aws_auth[0] will be destroyed
  # (because kubernetes_config_map_v1_data.aws_auth is not in configuration)
  - resource "kubernetes_config_map_v1_data" "aws_auth" {
      - data          = {
          - "mapAccounts" = jsonencode([])
          - "mapRoles"    = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::245948672511:role/node-group-1-eks-node-group-2023090517575741280000000a"
                  "username": "system:node:{{EC2PrivateDNSName}}"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::245948672511:role/eks-admin"
                  "username": "eks-admin"
            EOT
          - "mapUsers"    = jsonencode([])
        } -> null
      - field_manager = "Terraform" -> null
      - force         = true -> null
      - id            = "kube-system/aws-auth" -> null

      - metadata {
          - name      = "aws-auth" -> null
          - namespace = "kube-system" -> null
        }
    }

  # module.infrastructure.module.ckan_eks.module.eks.time_sleep.this[0] must be replaced
+/- resource "time_sleep" "this" {
      ~ id              = "2025-10-10T13:57:10Z" -> (known after apply)
      ~ triggers        = { # forces replacement
          + "certificate_authority_data"         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJWHFNb2hIRS9xcUl3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TXpBNU1EY3lNVFEzTURCYUZ3MHpNekE1TURReU1UUTNNREJhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURBT1k1dnZOYTRvdUc1T0hmd1ZvaFdUUnBwUUtMeTVibUZPUm9jUGhrckhNS0xYeE5oWFNCZVdZeU8KSjlERi9KYjFqWk9Zc2c0Nng1RUJCTk5BQXhROWphejJZaHgreTF2MldrWDVrampkc0NJUHEyTzlYT3hxa0dYOQpMZDR4ZEtuSzljS2xVWEo4VlVJVzhyZlAwQ2JkdkV0V3BEZXIwQ3NrVnU1NHJsWDJMZlNSczNHTGhmd0FoZUduCmNEbnU5SitwSDFaRnM5dlBrMTlQK0swbWNVVkZ2V2hCRm1JeWNlZ3g2ai9tUHBDNmdheHpEL25XMkt0T3UzaWEKZGV2RzZpOEpxcmhra1FQaytnNmxLLzk5eHlvK2JYdjhTZzNYQWIveUNsNEt3MHZuamJzRmFDT2hQekROeFlMUwoyM2tzMWN0V0h4NE03dXRyZEtFdU00TVhuTnR6QWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJRdUJWMDFLaG5Za0ZlQXBWNmk4MzFUb05WY1VUQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQUovYzAyNXhiUwpxa3c3eVRxSTFKYlRTNWJLU3FSMTlYQjJuQ0xiMzBnVlhzVVRYYnNjekZjRC84aVEvRVNKVVVYbWp4NTY1b1VvClg0WGFZUGdlSUk1T00zZ1JmVmtaUFNoUGxZTi8rcGk2R29zTmYvM3VzQm82RzE4bW05RjFDVDBNSnkzbjJ0OXEKdFVIdVRMaFhoS0I1enl2TXdxQXpLZVYxbjUzMjk2L09tQlpZTFIvUG9CNEhaOTdEcGlyY3Nnalo0WkRaZzlBKwp0NTYrc1F1amNqOTFzNitYM2xwcFUwOEt6b1oxNkJUVGdDMUNCZDZqTHJueU1hWVU1NnFsY2svTlBOa0hPZ3NOCjl5Qmtadkc0Z2J2blZ4NTdUc2poSXNkSjhCWXdnV3B1dTVxYUt4RmhxWEF3TklwSlhtbFc2UzNzcFFMVnk4L0IKNCtKSWZnSllVa1J5Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
          - "cluster_certificate_authority_data" = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJWHFNb2hIRS9xcUl3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TXpBNU1EY3lNVFEzTURCYUZ3MHpNekE1TURReU1UUTNNREJhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURBT1k1dnZOYTRvdUc1T0hmd1ZvaFdUUnBwUUtMeTVibUZPUm9jUGhrckhNS0xYeE5oWFNCZVdZeU8KSjlERi9KYjFqWk9Zc2c0Nng1RUJCTk5BQXhROWphejJZaHgreTF2MldrWDVrampkc0NJUHEyTzlYT3hxa0dYOQpMZDR4ZEtuSzljS2xVWEo4VlVJVzhyZlAwQ2JkdkV0V3BEZXIwQ3NrVnU1NHJsWDJMZlNSczNHTGhmd0FoZUduCmNEbnU5SitwSDFaRnM5dlBrMTlQK0swbWNVVkZ2V2hCRm1JeWNlZ3g2ai9tUHBDNmdheHpEL25XMkt0T3UzaWEKZGV2RzZpOEpxcmhra1FQaytnNmxLLzk5eHlvK2JYdjhTZzNYQWIveUNsNEt3MHZuamJzRmFDT2hQekROeFlMUwoyM2tzMWN0V0h4NE03dXRyZEtFdU00TVhuTnR6QWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJRdUJWMDFLaG5Za0ZlQXBWNmk4MzFUb05WY1VUQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQUovYzAyNXhiUwpxa3c3eVRxSTFKYlRTNWJLU3FSMTlYQjJuQ0xiMzBnVlhzVVRYYnNjekZjRC84aVEvRVNKVVVYbWp4NTY1b1VvClg0WGFZUGdlSUk1T00zZ1JmVmtaUFNoUGxZTi8rcGk2R29zTmYvM3VzQm82RzE4bW05RjFDVDBNSnkzbjJ0OXEKdFVIdVRMaFhoS0I1enl2TXdxQXpLZVYxbjUzMjk2L09tQlpZTFIvUG9CNEhaOTdEcGlyY3Nnalo0WkRaZzlBKwp0NTYrc1F1amNqOTFzNitYM2xwcFUwOEt6b1oxNkJUVGdDMUNCZDZqTHJueU1hWVU1NnFsY2svTlBOa0hPZ3NOCjl5Qmtadkc0Z2J2blZ4NTdUc2poSXNkSjhCWXdnV3B1dTVxYUt4RmhxWEF3TklwSlhtbFc2UzNzcFFMVnk4L0IKNCtKSWZnSllVa1J5Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> null
          - "cluster_endpoint"                   = "https://CC8A3A317728888AD3793D51F6434E7F.gr7.us-east-1.eks.amazonaws.com" -> null
          - "cluster_name"                       = "ckan-dev" -> null
          - "cluster_version"                    = "1.32" -> null
          + "endpoint"                           = "https://CC8A3A317728888AD3793D51F6434E7F.gr7.us-east-1.eks.amazonaws.com"
          + "kubernetes_version"                 = "1.32"
          + "name"                               = "ckan-dev"
          + "service_cidr"                       = "172.20.0.0/16"
        }
        # (1 unchanged attribute hidden)
    }

  # module.infrastructure.module.ckan_vpc.module.vpc.aws_nat_gateway.this[0] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                                 = "nat-0ebec8a05f31f0abe"
      + regional_nat_gateway_address       = (known after apply)
        tags                               = {
            "Environment" = "dev"
            "Name"        = "ckan-dev-vpc-us-east-1a"
        }
        # (14 unchanged attributes hidden)
    }

  # module.infrastructure.module.ckan_eks.module.eks.module.eks_managed_node_group["one"].aws_eks_node_group.this[0] must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ ami_type               = "AL2_x86_64" -> "AL2023_x86_64_STANDARD" # forces replacement
      ~ arn                    = "arn:aws:eks:us-east-1:245948672511:nodegroup/ckan-dev/node-group-1-20230907215244672200000005/2ac538d1-0faf-df4d-bc1d-514f8455dc5c" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "ckan-dev:node-group-1-20230907215244672200000005" -> (known after apply)
      - labels                 = {} -> null
      ~ node_group_name        = "node-group-1-20230907215244672200000005" -> (known after apply)
      ~ release_version        = "1.32.9-20251007" -> "1.32.9-20251120"
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-node-group-1-20230907215244672200000005-2ac538d1-0faf-df4d-bc1d-514f8455dc5c"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
        tags                   = {
            "Environment" = "dev"
            "Name"        = "node-group-1"
        }
        # (9 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0ee9108921883f95e"
          ~ name    = "one-20230905180917934700000014" -> (known after apply)
          ~ version = "5" -> (known after apply)
        }

      - timeouts {}

      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.infrastructure.module.ckan_eks.module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] has moved to module.infrastructure.module.ckan_eks.module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]
    resource "aws_iam_role_policy_attachment" "this" {
        id         = "node-group-1-eks-node-group-2023090517575741280000000a-2023090517580006230000000f"
        # (2 unchanged attributes hidden)
    }

  # module.infrastructure.module.ckan_eks.module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] has moved to module.infrastructure.module.ckan_eks.module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]
    resource "aws_iam_role_policy_attachment" "this" {
        id         = "node-group-1-eks-node-group-2023090517575741280000000a-2023090517575973240000000d"
        # (2 unchanged attributes hidden)
    }

  # module.infrastructure.module.ckan_eks.module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] has moved to module.infrastructure.module.ckan_eks.module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]
    resource "aws_iam_role_policy_attachment" "this" {
        id         = "node-group-1-eks-node-group-2023090517575741280000000a-2023090517575985890000000e"
        # (2 unchanged attributes hidden)
    }

  # module.infrastructure.module.ckan_eks.module.eks.module.eks_managed_node_group["one"].aws_launch_template.this[0] will be updated in-place
  ~ resource "aws_launch_template" "this" {
      ~ default_version         = 5 -> (known after apply)
        id                      = "lt-0ee9108921883f95e"
      ~ latest_version          = 5 -> (known after apply)
        name                    = "one-20230905180917934700000014"
        tags                    = {
            "Environment" = "dev"
        }
      ~ vpc_security_group_ids  = [
          - "sg-0822e99fbc6d964b3",
            # (1 unchanged element hidden)
        ]
        # (9 unchanged attributes hidden)

      ~ metadata_options {
          ~ http_put_response_hop_limit = 2 -> 1
            # (2 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.infrastructure.module.ckan_eks.module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
        id                                 = "f64fc288-019a-4f16-b35d-23b27000ae97"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "kms:Update*",
                          - "kms:UntagResource",
                          - "kms:TagResource",
                          - "kms:ScheduleKeyDeletion",
                          - "kms:Revoke*",
                          - "kms:Put*",
                          - "kms:List*",
                          - "kms:Get*",
                          - "kms:Enable*",
                          - "kms:Disable*",
                          - "kms:Describe*",
                          - "kms:Delete*",
                          - "kms:Create*",
                          - "kms:CancelKeyDeletion",
                        ] -> "kms:*"
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::245948672511:user/terraform-service-account" -> "arn:aws:iam::245948672511:root"
                        }
                      ~ Sid       = "KeyAdministration" -> "Default"
                        # (2 unchanged attributes hidden)
                    },
                  + {
                      + Action    = [
                          + "kms:Update*",
                          + "kms:UntagResource",
                          + "kms:TagResource",
                          + "kms:ScheduleKeyDeletion",
                          + "kms:Revoke*",
                          + "kms:ReplicateKey",
                          + "kms:Put*",
                          + "kms:List*",
                          + "kms:ImportKeyMaterial",
                          + "kms:Get*",
                          + "kms:Enable*",
                          + "kms:Disable*",
                          + "kms:Describe*",
                          + "kms:Delete*",
                          + "kms:Create*",
                          + "kms:CancelKeyDeletion",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::245948672511:user/terraform-service-account"
                        }
                      + Resource  = "*"
                      + Sid       = "KeyAdministration"
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::245948672511:role/ckan-dev-cluster-20230907213954714200000001"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ tags                               = {
            "Environment"           = "dev"
          + "terraform-aws-modules" = "eks"
        }
      ~ tags_all                           = {
          + "terraform-aws-modules" = "eks"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.infrastructure.module.ckan_rds.module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enhanced_monitoring" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]

          + principals {
              + identifiers = [
                  + "monitoring.rds.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.infrastructure.module.ckan_rds.module.db.module.db_instance.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.infrastructure.module.ckan_rds.module.db.module.db_instance.aws_db_instance.this[0] will be updated in-place
  ~ resource "aws_db_instance" "this" {
        id                                    = "db-MMFLGGGHIOZ5FIAWYM5O4ZU6K4"
        tags                                  = {}
        # (60 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.infrastructure.module.ckan_eks.module.eks.module.eks_managed_node_group["one"].module.user_data.null_resource.validate_cluster_service_cidr will be created
  + resource "null_resource" "validate_cluster_service_cidr" {
      + id = (known after apply)
    }

Plan: 7 to add, 17 to change, 4 to destroy.
```